docs/evidence/s1-C/10-k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: loadtest/s1_latency.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/100 VUs, 1532 complete and 0 interrupted iterations
default   [   1% ] 001/100 VUs  0m01.0s/2m00.0s

running (0m02.0s), 001/100 VUs, 3157 complete and 0 interrupted iterations
default   [   2% ] 001/100 VUs  0m02.0s/2m00.0s

running (0m03.0s), 001/100 VUs, 4689 complete and 0 interrupted iterations
default   [   2% ] 001/100 VUs  0m03.0s/2m00.0s

running (0m04.0s), 002/100 VUs, 7251 complete and 0 interrupted iterations
default   [   3% ] 002/100 VUs  0m04.0s/2m00.0s

running (0m05.0s), 002/100 VUs, 10214 complete and 0 interrupted iterations
default   [   4% ] 002/100 VUs  0m05.0s/2m00.0s

running (0m06.0s), 002/100 VUs, 13294 complete and 0 interrupted iterations
default   [   5% ] 002/100 VUs  0m06.0s/2m00.0s

running (0m07.0s), 003/100 VUs, 16616 complete and 0 interrupted iterations
default   [   6% ] 003/100 VUs  0m07.0s/2m00.0s

running (0m08.0s), 003/100 VUs, 21201 complete and 0 interrupted iterations
default   [   7% ] 003/100 VUs  0m08.0s/2m00.0s

running (0m09.0s), 003/100 VUs, 25733 complete and 0 interrupted iterations
default   [   7% ] 003/100 VUs  0m09.0s/2m00.0s

running (0m10.0s), 003/100 VUs, 30410 complete and 0 interrupted iterations
default   [   8% ] 003/100 VUs  0m10.0s/2m00.0s

running (0m11.0s), 004/100 VUs, 36467 complete and 0 interrupted iterations
default   [   9% ] 004/100 VUs  0m11.0s/2m00.0s

running (0m12.0s), 004/100 VUs, 42368 complete and 0 interrupted iterations
default   [  10% ] 004/100 VUs  0m12.0s/2m00.0s

running (0m13.0s), 004/100 VUs, 48315 complete and 0 interrupted iterations
default   [  11% ] 004/100 VUs  0m13.0s/2m00.0s

running (0m14.0s), 005/100 VUs, 54763 complete and 0 interrupted iterations
default   [  12% ] 005/100 VUs  0m14.0s/2m00.0s

running (0m15.0s), 005/100 VUs, 61140 complete and 0 interrupted iterations
default   [  12% ] 005/100 VUs  0m15.0s/2m00.0s

running (0m16.0s), 005/100 VUs, 67214 complete and 0 interrupted iterations
default   [  13% ] 005/100 VUs  0m16.0s/2m00.0s

running (0m17.0s), 006/100 VUs, 73408 complete and 0 interrupted iterations
default   [  14% ] 006/100 VUs  0m17.0s/2m00.0s

running (0m18.0s), 006/100 VUs, 79784 complete and 0 interrupted iterations
default   [  15% ] 006/100 VUs  0m18.0s/2m00.0s

running (0m19.0s), 006/100 VUs, 86066 complete and 0 interrupted iterations
default   [  16% ] 006/100 VUs  0m19.0s/2m00.0s

running (0m20.0s), 006/100 VUs, 92536 complete and 0 interrupted iterations
default   [  17% ] 006/100 VUs  0m20.0s/2m00.0s

running (0m21.0s), 007/100 VUs, 99058 complete and 0 interrupted iterations
default   [  17% ] 007/100 VUs  0m21.0s/2m00.0s

running (0m22.0s), 007/100 VUs, 105535 complete and 0 interrupted iterations
default   [  18% ] 007/100 VUs  0m22.0s/2m00.0s

running (0m23.0s), 007/100 VUs, 111696 complete and 0 interrupted iterations
default   [  19% ] 007/100 VUs  0m23.0s/2m00.0s

running (0m24.0s), 008/100 VUs, 118540 complete and 0 interrupted iterations
default   [  20% ] 008/100 VUs  0m24.0s/2m00.0s

running (0m25.0s), 008/100 VUs, 125254 complete and 0 interrupted iterations
default   [  21% ] 008/100 VUs  0m25.0s/2m00.0s

running (0m26.0s), 008/100 VUs, 132205 complete and 0 interrupted iterations
default   [  22% ] 008/100 VUs  0m26.0s/2m00.0s

running (0m27.0s), 009/100 VUs, 138354 complete and 0 interrupted iterations
default   [  22% ] 009/100 VUs  0m27.0s/2m00.0s

running (0m28.0s), 009/100 VUs, 145020 complete and 0 interrupted iterations
default   [  23% ] 009/100 VUs  0m28.0s/2m00.0s

running (0m29.0s), 009/100 VUs, 151935 complete and 0 interrupted iterations
default   [  24% ] 009/100 VUs  0m29.0s/2m00.0s

running (0m30.0s), 009/100 VUs, 158714 complete and 0 interrupted iterations
default   [  25% ] 009/100 VUs  0m30.0s/2m00.0s

running (0m31.0s), 011/100 VUs, 165513 complete and 0 interrupted iterations
default   [  26% ] 011/100 VUs  0m31.0s/2m00.0s

running (0m32.0s), 012/100 VUs, 172259 complete and 0 interrupted iterations
default   [  27% ] 012/100 VUs  0m32.0s/2m00.0s

running (0m33.0s), 014/100 VUs, 178536 complete and 0 interrupted iterations
default   [  27% ] 014/100 VUs  0m33.0s/2m00.0s

running (0m34.0s), 015/100 VUs, 185185 complete and 0 interrupted iterations
default   [  28% ] 015/100 VUs  0m34.0s/2m00.0s

running (0m35.0s), 017/100 VUs, 191761 complete and 0 interrupted iterations
default   [  29% ] 017/100 VUs  0m35.0s/2m00.0s

running (0m36.0s), 018/100 VUs, 198065 complete and 0 interrupted iterations
default   [  30% ] 018/100 VUs  0m36.0s/2m00.0s

running (0m37.0s), 020/100 VUs, 204488 complete and 0 interrupted iterations
default   [  31% ] 020/100 VUs  0m37.0s/2m00.0s

running (0m38.0s), 021/100 VUs, 211210 complete and 0 interrupted iterations
default   [  32% ] 021/100 VUs  0m38.0s/2m00.0s

running (0m39.0s), 023/100 VUs, 217373 complete and 0 interrupted iterations
default   [  32% ] 023/100 VUs  0m39.0s/2m00.0s

running (0m40.0s), 024/100 VUs, 223910 complete and 0 interrupted iterations
default   [  33% ] 024/100 VUs  0m40.0s/2m00.0s

running (0m41.0s), 026/100 VUs, 230715 complete and 0 interrupted iterations
default   [  34% ] 026/100 VUs  0m41.0s/2m00.0s

running (0m42.0s), 027/100 VUs, 236930 complete and 0 interrupted iterations
default   [  35% ] 027/100 VUs  0m42.0s/2m00.0s

running (0m43.0s), 029/100 VUs, 243075 complete and 0 interrupted iterations
default   [  36% ] 029/100 VUs  0m43.0s/2m00.0s

running (0m44.0s), 030/100 VUs, 249655 complete and 0 interrupted iterations
default   [  37% ] 030/100 VUs  0m44.0s/2m00.0s

running (0m45.0s), 032/100 VUs, 255963 complete and 0 interrupted iterations
default   [  37% ] 032/100 VUs  0m45.0s/2m00.0s

running (0m46.0s), 033/100 VUs, 262472 complete and 0 interrupted iterations
default   [  38% ] 033/100 VUs  0m46.0s/2m00.0s

running (0m47.0s), 035/100 VUs, 268770 complete and 0 interrupted iterations
default   [  39% ] 035/100 VUs  0m47.0s/2m00.0s

running (0m48.0s), 036/100 VUs, 274991 complete and 0 interrupted iterations
default   [  40% ] 036/100 VUs  0m48.0s/2m00.0s

running (0m49.0s), 038/100 VUs, 281347 complete and 0 interrupted iterations
default   [  41% ] 038/100 VUs  0m49.0s/2m00.0s

running (0m50.0s), 039/100 VUs, 287952 complete and 0 interrupted iterations
default   [  42% ] 039/100 VUs  0m50.0s/2m00.0s

running (0m51.0s), 041/100 VUs, 294377 complete and 0 interrupted iterations
default   [  42% ] 041/100 VUs  0m51.0s/2m00.0s

running (0m52.0s), 042/100 VUs, 300664 complete and 0 interrupted iterations
default   [  43% ] 042/100 VUs  0m52.0s/2m00.0s

running (0m53.0s), 044/100 VUs, 306697 complete and 0 interrupted iterations
default   [  44% ] 044/100 VUs  0m53.0s/2m00.0s

running (0m54.0s), 045/100 VUs, 312957 complete and 0 interrupted iterations
default   [  45% ] 045/100 VUs  0m54.0s/2m00.0s

running (0m55.0s), 047/100 VUs, 319176 complete and 0 interrupted iterations
default   [  46% ] 047/100 VUs  0m55.0s/2m00.0s

running (0m56.0s), 048/100 VUs, 325735 complete and 0 interrupted iterations
default   [  47% ] 048/100 VUs  0m56.0s/2m00.0s

running (0m57.0s), 050/100 VUs, 332028 complete and 0 interrupted iterations
default   [  47% ] 050/100 VUs  0m57.0s/2m00.0s

running (0m58.0s), 051/100 VUs, 338276 complete and 0 interrupted iterations
default   [  48% ] 051/100 VUs  0m58.0s/2m00.0s

running (0m59.0s), 053/100 VUs, 344759 complete and 0 interrupted iterations
default   [  49% ] 053/100 VUs  0m59.0s/2m00.0s

running (1m00.0s), 054/100 VUs, 351313 complete and 0 interrupted iterations
default   [  50% ] 054/100 VUs  1m00.0s/2m00.0s

running (1m01.0s), 056/100 VUs, 357826 complete and 0 interrupted iterations
default   [  51% ] 056/100 VUs  1m01.0s/2m00.0s

running (1m02.0s), 057/100 VUs, 364314 complete and 0 interrupted iterations
default   [  52% ] 057/100 VUs  1m02.0s/2m00.0s

running (1m03.0s), 059/100 VUs, 370774 complete and 0 interrupted iterations
default   [  52% ] 059/100 VUs  1m03.0s/2m00.0s

running (1m04.0s), 060/100 VUs, 377294 complete and 0 interrupted iterations
default   [  53% ] 060/100 VUs  1m04.0s/2m00.0s

running (1m05.0s), 062/100 VUs, 383800 complete and 0 interrupted iterations
default   [  54% ] 062/100 VUs  1m05.0s/2m00.0s

running (1m06.0s), 063/100 VUs, 390268 complete and 0 interrupted iterations
default   [  55% ] 063/100 VUs  1m06.0s/2m00.0s

running (1m07.0s), 065/100 VUs, 396373 complete and 0 interrupted iterations
default   [  56% ] 065/100 VUs  1m07.0s/2m00.0s

running (1m08.0s), 066/100 VUs, 402822 complete and 0 interrupted iterations
default   [  57% ] 066/100 VUs  1m08.0s/2m00.0s

running (1m09.0s), 068/100 VUs, 408836 complete and 0 interrupted iterations
default   [  57% ] 068/100 VUs  1m09.0s/2m00.0s

running (1m10.0s), 069/100 VUs, 415168 complete and 0 interrupted iterations
default   [  58% ] 069/100 VUs  1m10.0s/2m00.0s

running (1m11.0s), 071/100 VUs, 421785 complete and 0 interrupted iterations
default   [  59% ] 071/100 VUs  1m11.0s/2m00.0s

running (1m12.0s), 072/100 VUs, 428078 complete and 0 interrupted iterations
default   [  60% ] 072/100 VUs  1m12.0s/2m00.0s

running (1m13.0s), 074/100 VUs, 434187 complete and 0 interrupted iterations
default   [  61% ] 074/100 VUs  1m13.0s/2m00.0s

running (1m14.0s), 075/100 VUs, 440511 complete and 0 interrupted iterations
default   [  62% ] 075/100 VUs  1m14.0s/2m00.0s

running (1m15.0s), 077/100 VUs, 446394 complete and 0 interrupted iterations
default   [  62% ] 077/100 VUs  1m15.0s/2m00.0s

running (1m16.0s), 078/100 VUs, 452738 complete and 0 interrupted iterations
default   [  63% ] 078/100 VUs  1m16.0s/2m00.0s

running (1m17.0s), 080/100 VUs, 458956 complete and 0 interrupted iterations
default   [  64% ] 080/100 VUs  1m17.0s/2m00.0s

running (1m18.0s), 081/100 VUs, 465327 complete and 0 interrupted iterations
default   [  65% ] 081/100 VUs  1m18.0s/2m00.0s

running (1m19.0s), 083/100 VUs, 471772 complete and 0 interrupted iterations
default   [  66% ] 083/100 VUs  1m19.0s/2m00.0s

running (1m20.0s), 084/100 VUs, 478161 complete and 0 interrupted iterations
default   [  67% ] 084/100 VUs  1m20.0s/2m00.0s

running (1m21.0s), 086/100 VUs, 484351 complete and 0 interrupted iterations
default   [  67% ] 086/100 VUs  1m21.0s/2m00.0s

running (1m22.0s), 087/100 VUs, 490483 complete and 0 interrupted iterations
default   [  68% ] 087/100 VUs  1m22.0s/2m00.0s

running (1m23.0s), 089/100 VUs, 496871 complete and 0 interrupted iterations
default   [  69% ] 089/100 VUs  1m23.0s/2m00.0s

running (1m24.0s), 090/100 VUs, 503173 complete and 0 interrupted iterations
default   [  70% ] 090/100 VUs  1m24.0s/2m00.0s

running (1m25.0s), 092/100 VUs, 509418 complete and 0 interrupted iterations
default   [  71% ] 092/100 VUs  1m25.0s/2m00.0s

running (1m26.0s), 093/100 VUs, 515701 complete and 0 interrupted iterations
default   [  72% ] 093/100 VUs  1m26.0s/2m00.0s

running (1m27.0s), 095/100 VUs, 521913 complete and 0 interrupted iterations
default   [  72% ] 095/100 VUs  1m27.0s/2m00.0s

running (1m28.0s), 096/100 VUs, 528241 complete and 0 interrupted iterations
default   [  73% ] 096/100 VUs  1m28.0s/2m00.0s

running (1m29.0s), 098/100 VUs, 534576 complete and 0 interrupted iterations
default   [  74% ] 098/100 VUs  1m29.0s/2m00.0s

running (1m30.0s), 099/100 VUs, 541027 complete and 0 interrupted iterations
default   [  75% ] 099/100 VUs  1m30.0s/2m00.0s

running (1m31.0s), 100/100 VUs, 547401 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  1m31.0s/2m00.0s

running (1m32.0s), 100/100 VUs, 553858 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  1m32.0s/2m00.0s

running (1m33.0s), 100/100 VUs, 560227 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  1m33.0s/2m00.0s

running (1m34.0s), 100/100 VUs, 566425 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  1m34.0s/2m00.0s

running (1m35.0s), 100/100 VUs, 572680 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  1m35.0s/2m00.0s

running (1m36.0s), 100/100 VUs, 579072 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  1m36.0s/2m00.0s

running (1m37.0s), 100/100 VUs, 585232 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  1m37.0s/2m00.0s

running (1m38.0s), 100/100 VUs, 591603 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  1m38.0s/2m00.0s

running (1m39.0s), 100/100 VUs, 597546 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  1m39.0s/2m00.0s

running (1m40.0s), 100/100 VUs, 603951 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  1m40.0s/2m00.0s

running (1m41.0s), 100/100 VUs, 610372 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  1m41.0s/2m00.0s

running (1m42.0s), 100/100 VUs, 616629 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  1m42.0s/2m00.0s

running (1m43.0s), 100/100 VUs, 622973 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  1m43.0s/2m00.0s

running (1m44.0s), 100/100 VUs, 629002 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  1m44.0s/2m00.0s

running (1m45.0s), 100/100 VUs, 635282 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  1m45.0s/2m00.0s

running (1m46.0s), 100/100 VUs, 641552 complete and 0 interrupted iterations
default   [  88% ] 100/100 VUs  1m46.0s/2m00.0s

running (1m47.0s), 100/100 VUs, 647650 complete and 0 interrupted iterations
default   [  89% ] 100/100 VUs  1m47.0s/2m00.0s

running (1m48.0s), 100/100 VUs, 654068 complete and 0 interrupted iterations
default   [  90% ] 100/100 VUs  1m48.0s/2m00.0s

running (1m49.0s), 100/100 VUs, 660305 complete and 0 interrupted iterations
default   [  91% ] 100/100 VUs  1m49.0s/2m00.0s

running (1m50.0s), 100/100 VUs, 666565 complete and 0 interrupted iterations
default   [  92% ] 100/100 VUs  1m50.0s/2m00.0s

running (1m51.0s), 100/100 VUs, 672766 complete and 0 interrupted iterations
default   [  92% ] 100/100 VUs  1m51.0s/2m00.0s

running (1m52.0s), 100/100 VUs, 678795 complete and 0 interrupted iterations
default   [  93% ] 100/100 VUs  1m52.0s/2m00.0s

running (1m53.0s), 100/100 VUs, 684892 complete and 0 interrupted iterations
default   [  94% ] 100/100 VUs  1m53.0s/2m00.0s

running (1m54.0s), 100/100 VUs, 690707 complete and 0 interrupted iterations
default   [  95% ] 100/100 VUs  1m54.0s/2m00.0s

running (1m55.0s), 100/100 VUs, 696948 complete and 0 interrupted iterations
default   [  96% ] 100/100 VUs  1m55.0s/2m00.0s

running (1m56.0s), 100/100 VUs, 703150 complete and 0 interrupted iterations
default   [  97% ] 100/100 VUs  1m56.0s/2m00.0s

running (1m57.0s), 100/100 VUs, 709402 complete and 0 interrupted iterations
default   [  97% ] 100/100 VUs  1m57.0s/2m00.0s

running (1m58.0s), 100/100 VUs, 715809 complete and 0 interrupted iterations
default   [  98% ] 100/100 VUs  1m58.0s/2m00.0s

running (1m59.0s), 100/100 VUs, 722152 complete and 0 interrupted iterations
default   [  99% ] 100/100 VUs  1m59.0s/2m00.0s

running (2m00.0s), 100/100 VUs, 728312 complete and 0 interrupted iterations
default   [ 100% ] 100/100 VUs  2m00.0s/2m00.0s
time="2026-09-05T01:37:02+07:00" level=info msg="[k6-reporter v3.0.4] Generating HTML summary report, with theme: default" source=console
     ✓ status 200

     checks.........................: 100.00% ✓ 728412      ✗ 0     
     data_received..................: 548 MB  4.6 MB/s
     data_sent......................: 120 MB  995 kB/s
     http_req_blocked...............: avg=740ns  min=0s       med=1µs    max=630µs   p(90)=1µs     p(95)=1µs    
     http_req_connecting............: avg=21ns   min=0s       med=0s     max=375µs   p(90)=0s      p(95)=0s     
   ✓ http_req_duration..............: avg=8.78ms min=321µs    med=4.97ms max=70.55ms p(90)=19.87ms p(95)=46.74ms
     ✓ { class:w0 }.................: avg=8.87ms min=321µs    med=5.03ms max=70.55ms p(90)=20.2ms  p(95)=46.84ms
     ✓ { class:w3 }.................: avg=8.89ms min=345µs    med=5.06ms max=69.66ms p(90)=20.09ms p(95)=46.86ms
     ✓ { class:w4 }.................: avg=8.61ms min=346µs    med=4.87ms max=70.37ms p(90)=19.46ms p(95)=46.54ms
     ✓ { class:w5 }.................: avg=8.75ms min=351µs    med=4.92ms max=68.86ms p(90)=19.76ms p(95)=46.71ms
       { expected_response:true }...: avg=8.78ms min=321µs    med=4.97ms max=70.55ms p(90)=19.87ms p(95)=46.74ms
   ✓ http_req_failed................: 0.00%   ✓ 0           ✗ 728412
     http_req_receiving.............: avg=9.68µs min=3µs      med=8µs    max=1.71ms  p(90)=15µs    p(95)=24µs   
     http_req_sending...............: avg=3.01µs min=1µs      med=2µs    max=781µs   p(90)=5µs     p(95)=7µs    
     http_req_tls_handshaking.......: avg=0s     min=0s       med=0s     max=0s      p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=8.77ms min=311µs    med=4.96ms max=70.54ms p(90)=19.85ms p(95)=46.73ms
     http_reqs......................: 728412  6068.075842/s
     iteration_duration.............: avg=8.81ms min=340.54µs med=5ms    max=70.58ms p(90)=19.9ms  p(95)=46.77ms
     iterations.....................: 728412  6068.075842/s
     vus............................: 100     min=1         max=100 
     vus_max........................: 100     min=100       max=100 
running (2m00.0s), 000/100 VUs, 728412 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  2m0s